Duet3D/Duet3Expansion/src/atmel/SAME70_DFP/2.3.98/same70b/edc/ATSAME70J20B.PIC
      <edc:SFRDef edc:_addr="0x40050278" edc:access="----------------rrrrrrrrrrrrrrrr" edc:cname="GMAC_TXLPI" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="COUNT" edc:desc="Count of LPI transitions (cleared on read)" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005027C" edc:access="--------rrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="GMAC_TXLPITIME" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LPITIME" edc:desc="Time in LPI (cleared on read)" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40050280" edc:offset="0x17C"/>
      <edc:SFRDef edc:_addr="0x400503FC" edc:access="--------------------rr--rrr--rr-" edc:cname="GMAC_ISRPQ0" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RCOMP" edc:desc="Receive Complete" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXUBR" edc:desc="RX Used Bit Read" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RLEX" edc:desc="Retry Limit Exceeded or Late Collision" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFC" edc:desc="Transmit Frame Corruption Due to AHB Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCOMP" edc:desc="Transmit Complete" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ROVR" edc:desc="Receive Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HRESP" edc:desc="HRESP Not OK" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050400" edc:access="--------------------rr--rrr--rr-" edc:cname="GMAC_ISRPQ1" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RCOMP" edc:desc="Receive Complete" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXUBR" edc:desc="RX Used Bit Read" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RLEX" edc:desc="Retry Limit Exceeded or Late Collision" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFC" edc:desc="Transmit Frame Corruption Due to AHB Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCOMP" edc:desc="Transmit Complete" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ROVR" edc:desc="Receive Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HRESP" edc:desc="HRESP Not OK" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050404" edc:access="--------------------rr--rrr--rr-" edc:cname="GMAC_ISRPQ2" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RCOMP" edc:desc="Receive Complete" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXUBR" edc:desc="RX Used Bit Read" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RLEX" edc:desc="Retry Limit Exceeded or Late Collision" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFC" edc:desc="Transmit Frame Corruption Due to AHB Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCOMP" edc:desc="Transmit Complete" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ROVR" edc:desc="Receive Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HRESP" edc:desc="HRESP Not OK" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050408" edc:access="--------------------rr--rrr--rr-" edc:cname="GMAC_ISRPQ3" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RCOMP" edc:desc="Receive Complete" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXUBR" edc:desc="RX Used Bit Read" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RLEX" edc:desc="Retry Limit Exceeded or Late Collision" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFC" edc:desc="Transmit Frame Corruption Due to AHB Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCOMP" edc:desc="Transmit Complete" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ROVR" edc:desc="Receive Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HRESP" edc:desc="HRESP Not OK" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005040C" edc:access="--------------------rr--rrr--rr-" edc:cname="GMAC_ISRPQ4" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RCOMP" edc:desc="Receive Complete" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXUBR" edc:desc="RX Used Bit Read" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RLEX" edc:desc="Retry Limit Exceeded or Late Collision" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFC" edc:desc="Transmit Frame Corruption Due to AHB Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCOMP" edc:desc="Transmit Complete" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ROVR" edc:desc="Receive Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HRESP" edc:desc="HRESP Not OK" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
