Duet3D/Duet3Expansion/src/atmel/SAME70_DFP/2.3.98/same70b/edc/ATSAME70J20B.PIC
      <edc:SFRDef edc:_addr="0x40050608" edc:access="--------------------ww--www--ww-" edc:cname="GMAC_IERPQ3" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RCOMP" edc:desc="Receive Complete" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXUBR" edc:desc="RX Used Bit Read" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RLEX" edc:desc="Retry Limit Exceeded or Late Collision" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFC" edc:desc="Transmit Frame Corruption Due to AHB Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCOMP" edc:desc="Transmit Complete" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ROVR" edc:desc="Receive Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HRESP" edc:desc="HRESP Not OK" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005060C" edc:access="--------------------ww--www--ww-" edc:cname="GMAC_IERPQ4" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RCOMP" edc:desc="Receive Complete" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXUBR" edc:desc="RX Used Bit Read" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RLEX" edc:desc="Retry Limit Exceeded or Late Collision" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFC" edc:desc="Transmit Frame Corruption Due to AHB Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCOMP" edc:desc="Transmit Complete" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ROVR" edc:desc="Receive Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HRESP" edc:desc="HRESP Not OK" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40050610" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x4005061C" edc:access="--------------------ww--www--ww-" edc:cname="GMAC_IDRPQ0" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RCOMP" edc:desc="Receive Complete" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXUBR" edc:desc="RX Used Bit Read" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RLEX" edc:desc="Retry Limit Exceeded or Late Collision" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFC" edc:desc="Transmit Frame Corruption Due to AHB Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCOMP" edc:desc="Transmit Complete" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ROVR" edc:desc="Receive Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HRESP" edc:desc="HRESP Not OK" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050620" edc:access="--------------------ww--www--ww-" edc:cname="GMAC_IDRPQ1" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RCOMP" edc:desc="Receive Complete" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXUBR" edc:desc="RX Used Bit Read" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RLEX" edc:desc="Retry Limit Exceeded or Late Collision" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFC" edc:desc="Transmit Frame Corruption Due to AHB Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCOMP" edc:desc="Transmit Complete" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ROVR" edc:desc="Receive Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HRESP" edc:desc="HRESP Not OK" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050624" edc:access="--------------------ww--www--ww-" edc:cname="GMAC_IDRPQ2" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RCOMP" edc:desc="Receive Complete" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXUBR" edc:desc="RX Used Bit Read" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RLEX" edc:desc="Retry Limit Exceeded or Late Collision" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFC" edc:desc="Transmit Frame Corruption Due to AHB Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCOMP" edc:desc="Transmit Complete" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ROVR" edc:desc="Receive Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HRESP" edc:desc="HRESP Not OK" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050628" edc:access="--------------------ww--www--ww-" edc:cname="GMAC_IDRPQ3" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RCOMP" edc:desc="Receive Complete" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXUBR" edc:desc="RX Used Bit Read" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RLEX" edc:desc="Retry Limit Exceeded or Late Collision" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFC" edc:desc="Transmit Frame Corruption Due to AHB Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCOMP" edc:desc="Transmit Complete" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ROVR" edc:desc="Receive Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HRESP" edc:desc="HRESP Not OK" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
