Duet3D/Duet3Expansion/src/atmel/SAME70_DFP/2.3.98/same70b/edc/ATSAME70J20B.PIC
      <edc:AdjustPoint edc:_addr="0x40088064" edc:offset="0x9C"/>
      <edc:SFRDef edc:_addr="0x40088100" edc:access="-------------------nnnnn-nnnnnnn" edc:cname="MATRIX_MRCR" edc:nzwidth="0x20" ltx:memberofperipheral="MATRIX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RCB0" edc:desc="Remap Command Bit for Master 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RCB1" edc:desc="Remap Command Bit for Master 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RCB2" edc:desc="Remap Command Bit for Master 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RCB3" edc:desc="Remap Command Bit for Master 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RCB4" edc:desc="Remap Command Bit for Master 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RCB5" edc:desc="Remap Command Bit for Master 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RCB6" edc:desc="Remap Command Bit for Master 6" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RCB8" edc:desc="Remap Command Bit for Master 8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RCB9" edc:desc="Remap Command Bit for Master 9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RCB10" edc:desc="Remap Command Bit for Master 10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RCB11" edc:desc="Remap Command Bit for Master 11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RCB12" edc:desc="Remap Command Bit for Master 12" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40088104" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x40088110" edc:access="nnnnnnnnnnnnnnnn----------------" edc:cname="CCFG_CAN0" edc:nzwidth="0x20" ltx:memberofperipheral="MATRIX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x10"/>
            <edc:SFRFieldDef edc:cname="CAN0DMABA" edc:desc="CAN0 DMA Base Address" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40088114" edc:access="-------------------n----nnnn----" edc:cname="CCFG_SYSIO" edc:nzwidth="0x20" ltx:memberofperipheral="MATRIX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="SYSIO4" edc:desc="PB4 or TDI Assignment" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SYSIO5" edc:desc="PB5 or TDO/TRACESWO Assignment" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SYSIO6" edc:desc="PB6 or TMS/SWDIO Assignment" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SYSIO7" edc:desc="PB7 or TCK/SWCLK Assignment" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="SYSIO12" edc:desc="PB12 or ERASE Assignment" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40088118" edc:access="---------nnn--------------------" edc:cname="CCFG_PCCR" edc:nzwidth="0x20" ltx:memberofperipheral="MATRIX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x14"/>
            <edc:SFRFieldDef edc:cname="TC0CC" edc:desc="TC0 Clock Configuration" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2SC0CC" edc:desc="I2SC0 Clock Configuration" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2SC1CC" edc:desc="I2SC1 Clock Configuration" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4008811C" edc:access="-----------------------------nnn" edc:cname="CCFG_DYNCKG" edc:nzwidth="0x20" ltx:memberofperipheral="MATRIX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MATCKG" edc:desc="MATRIX Dynamic Clock Gating" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BRIDCKG" edc:desc="Bridge Dynamic Clock Gating Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EFCCKG" edc:desc="EFC Dynamic Clock Gating Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40088120" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x40088124" edc:access="---------------------------nnnnn" edc:cname="CCFG_SMCNFCS" edc:nzwidth="0x20" ltx:memberofperipheral="MATRIX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SMC_NFCS0" edc:desc="SMC NAND Flash Chip Select 0 Assignment" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SMC_NFCS1" edc:desc="SMC NAND Flash Chip Select 1 Assignment" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SMC_NFCS2" edc:desc="SMC NAND Flash Chip Select 2 Assignment" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SMC_NFCS3" edc:desc="SMC NAND Flash Chip Select 3 Assignment" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SDRAMEN" edc:desc="SDRAM Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40088128" edc:offset="0xBC"/>
      <edc:SFRDef edc:_addr="0x400881E4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:cname="MATRIX_WPMR" edc:nzwidth="0x20" ltx:memberofperipheral="MATRIX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WPEN" edc:desc="Write Protection Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:desc="Write Protection Key" edc:nzwidth="0x18">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x4D4154"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400881E8" edc:access="--------rrrrrrrrrrrrrrrr-------r" edc:cname="MATRIX_WPSR" edc:nzwidth="0x20" ltx:memberofperipheral="MATRIX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WPVS" edc:desc="Write Protection Violation Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:desc="Write Protection Violation Source" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
