Duet3D/Duet3Expansion/src/atmel/SAME70_DFP/2.3.98/same70b/edc/ATSAME70J20B.PIC
      <edc:AdjustPoint edc:_addr="0x400881EC" edc:offset="0x58224"/>
      <edc:SFRDef edc:_addr="0x400E0410" edc:access="--------n-----------------nn---n" edc:cname="UTMI_OHCIICR" edc:nzwidth="0x20" ltx:memberofperipheral="UTMI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RES0" edc:desc="USB PORTx Reset" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="ARIE" edc:desc="OHCI Asynchronous Resume Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="APPSTART" edc:desc="Reserved" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x11"/>
            <edc:SFRFieldDef edc:cname="UDPPUDIS" edc:desc="USB Device Pull-up Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400E0414" edc:offset="0x1C"/>
      <edc:SFRDef edc:_addr="0x400E0430" edc:access="------------------------------nn" edc:cname="UTMI_CKTRIM" edc:nzwidth="0x20" ltx:memberofperipheral="UTMI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FREQ" edc:desc="UTMI Reference Clock Frequency" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="XTAL12" edc:desc="12 MHz reference clock" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="XTAL16" edc:desc="16 MHz reference clock" edc:when="(field &amp; 0x3) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400E0434" edc:offset="0x1CC"/>
      <edc:SFRDef edc:_addr="0x400E0600" edc:access="-----------------wwwwwww--w-----" edc:cname="PMC_SCER" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="USBCLK" edc:desc="Enable USB FS Clock" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PCK0" edc:desc="Programmable Clock 0 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCK1" edc:desc="Programmable Clock 1 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCK2" edc:desc="Programmable Clock 2 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCK3" edc:desc="Programmable Clock 3 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCK4" edc:desc="Programmable Clock 4 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCK5" edc:desc="Programmable Clock 5 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCK6" edc:desc="Programmable Clock 6 Output Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0604" edc:access="-----------------wwwwwww--w-----" edc:cname="PMC_SCDR" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="USBCLK" edc:desc="Disable USB FS Clock" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PCK0" edc:desc="Programmable Clock 0 Output Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCK1" edc:desc="Programmable Clock 1 Output Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCK2" edc:desc="Programmable Clock 2 Output Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCK3" edc:desc="Programmable Clock 3 Output Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCK4" edc:desc="Programmable Clock 4 Output Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCK5" edc:desc="Programmable Clock 5 Output Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCK6" edc:desc="Programmable Clock 6 Output Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0608" edc:access="-----------------rrrrrrr--r----r" edc:cname="PMC_SCSR" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="HCLKS" edc:desc="HCLK Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="USBCLK" edc:desc="USB FS Clock Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PCK0" edc:desc="Programmable Clock 0 Output Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCK1" edc:desc="Programmable Clock 1 Output Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCK2" edc:desc="Programmable Clock 2 Output Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCK3" edc:desc="Programmable Clock 3 Output Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCK4" edc:desc="Programmable Clock 4 Output Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCK5" edc:desc="Programmable Clock 5 Output Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCK6" edc:desc="Programmable Clock 6 Output Status" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400E060C" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x400E0610" edc:access="wwwwwwwwwwwwwwww-------ww-------" edc:cname="PMC_PCER0" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="PID7" edc:desc="Peripheral Clock 7 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID8" edc:desc="Peripheral Clock 8 Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="PID16" edc:desc="Peripheral Clock 16 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID17" edc:desc="Peripheral Clock 17 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID18" edc:desc="Peripheral Clock 18 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID19" edc:desc="Peripheral Clock 19 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID20" edc:desc="Peripheral Clock 20 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID21" edc:desc="Peripheral Clock 21 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID22" edc:desc="Peripheral Clock 22 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID23" edc:desc="Peripheral Clock 23 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID24" edc:desc="Peripheral Clock 24 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID25" edc:desc="Peripheral Clock 25 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID26" edc:desc="Peripheral Clock 26 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID27" edc:desc="Peripheral Clock 27 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID28" edc:desc="Peripheral Clock 28 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID29" edc:desc="Peripheral Clock 29 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID30" edc:desc="Peripheral Clock 30 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID31" edc:desc="Peripheral Clock 31 Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0614" edc:access="wwwwwwwwwwwwwwww-------ww-------" edc:cname="PMC_PCDR0" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="PID7" edc:desc="Peripheral Clock 7 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID8" edc:desc="Peripheral Clock 8 Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="PID16" edc:desc="Peripheral Clock 16 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID17" edc:desc="Peripheral Clock 17 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID18" edc:desc="Peripheral Clock 18 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID19" edc:desc="Peripheral Clock 19 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID20" edc:desc="Peripheral Clock 20 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID21" edc:desc="Peripheral Clock 21 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID22" edc:desc="Peripheral Clock 22 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID23" edc:desc="Peripheral Clock 23 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID24" edc:desc="Peripheral Clock 24 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID25" edc:desc="Peripheral Clock 25 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID26" edc:desc="Peripheral Clock 26 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID27" edc:desc="Peripheral Clock 27 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID28" edc:desc="Peripheral Clock 28 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID29" edc:desc="Peripheral Clock 29 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID30" edc:desc="Peripheral Clock 30 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID31" edc:desc="Peripheral Clock 31 Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
